In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [17, 25, 19, 30, 15]}
df = pd.DataFrame(data)

In [3]:
df

      Name  Age
0    Alice   17
1      Bob   25
2  Charlie   19
3    David   30
4      Eva   15

In [4]:
new_df = df.loc[df['Age'] > 18][['Name','Age']]

In [5]:
new_df

      Name  Age
1      Bob   25
2  Charlie   19
3    David   30

In [6]:
df[(df['Age']>=18) & (df['Name'].str.startswith('C'))] [['Name',"Age"]]

      Name  Age
2  Charlie   19

In [7]:
# df['Age_group'] = np.where(df['Age'] > 18 ,'Adult','Teen')

In [8]:
df

      Name  Age
0    Alice   17
1      Bob   25
2  Charlie   19
3    David   30
4      Eva   15

In [9]:
df['Age_group'] = np.select(
                    [df['Age'] < 18,(df['Age']>=18 ) & (df['Age'] < 25),df['Age']>= 25],
                    ['Teen','Young_Adult','Adult'],
                    default = 'Safe')

In [10]:
df

      Name  Age    Age_group
0    Alice   17         Teen
1      Bob   25        Adult
2  Charlie   19  Young_Adult
3    David   30        Adult
4      Eva   15         Teen

In [11]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [17, 25, 19, 30, 15],
        'House': ['Red', 'Blue', 'Red', 'Blue', 'Red']}
df1 = pd.DataFrame(data)

In [12]:
df1

      Name  Age House
0    Alice   17   Red
1      Bob   25  Blue
2  Charlie   19   Red
3    David   30  Blue
4      Eva   15   Red

In [13]:
df.groupby('House') ['Age'].mean().reset_index(name = 'avg_age')

KeyError: 'House'

In [ ]:
df.groupby('House')['Age'].mean().reset_index(name='Average_Age')

  House  Average_Age
0  Blue         27.5
1   Red         17.0

In [ ]:
df1[df1['Age']>=18].groupby('House')['Age'].mean().reset_index(name = 'Avg_Age_house')

  House  Avg_Age_house
0  Blue           27.5
1   Red           19.0

In [ ]:
df1

      Name  Age House
0    Alice   17   Red
1      Bob   25  Blue
2  Charlie   19   Red
3    David   30  Blue
4      Eva   15   Red

In [ ]:
# new_df1 = df[df['Age']>=18]

In [ ]:
# new_df1

      Name  Age House
1      Bob   25  Blue
2  Charlie   19   Red
3    David   30  Blue

In [ ]:
# new_df1.groupby('House')['Age'].mean().reset_index(name = 'Avg_house_age')

  House  Avg_house_age
0  Blue           27.5
1   Red           19.0

In [15]:

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [17, 25, 19, 30, 15],
        'House': ['Red', 'Blue', 'Red', 'Blue', 'Red'],
        'Score': [88, 92, 95, 85, 78]}
df = pd.DataFrame(data)

In [16]:
df

      Name  Age House  Score
0    Alice   17   Red     88
1      Bob   25  Blue     92
2  Charlie   19   Red     95
3    David   30  Blue     85
4      Eva   15   Red     78

In [20]:
df['Age_gruou']  = df['Age'].apply(lambda y: 'Adult' if y >= 18 else 'young')

In [22]:
df

      Name  Age House  Score Age_gruou
0    Alice   17   Red     88     young
1      Bob   25  Blue     92     Adult
2  Charlie   19   Red     95     Adult
3    David   30  Blue     85     Adult
4      Eva   15   Red     78     young

In [25]:
avg_house_score = df.groupby('House')['Age'].mean()

In [26]:
df

      Name  Age House  Score Age_gruou
0    Alice   17   Red     88     young
1      Bob   25  Blue     92     Adult
2  Charlie   19   Red     95     Adult
3    David   30  Blue     85     Adult
4      Eva   15   Red     78     young